{"meta":{"title":"A Wasted Life","subtitle":null,"description":null,"author":"Albin George","url":"http://alb1n.com/blog"},"pages":[{"title":"About","date":"un22fin22","updated":"un22fin22","comments":true,"path":"about/index.html","permalink":"http://alb1n.com/blog/about/index.html","excerpt":"","text":"I’m Albin George. I’m always on the lookout to learn something new, but I believe I’m the laziest person alive. To make things worse, I’m also a procrastinator. Oh wait, there’s more. I’m a hardcore gamer. Until recently, I used to spent atleast 4 hours a day on games(mostly Dota). Anyways, this blog is my attempt to keep track of(and improve) my life."},{"title":"Categories","date":"un22fin22","updated":"un22fin22","comments":true,"path":"categories/index.html","permalink":"http://alb1n.com/blog/categories/index.html","excerpt":"","text":""},{"title":"Projects","date":"un22fin22","updated":"un22fin22","comments":true,"path":"projects/index.html","permalink":"http://alb1n.com/blog/projects/index.html","excerpt":"","text":"My side projectsIdeas Commit logger Logs the commit that you make on every repositories and maybe integrate it with task logger? Port Unbxd JS-SDK to React Can be better modularised that way DoneTask logger"},{"title":"Reading List","date":"un22fin22","updated":"un22fin22","comments":true,"path":"reading-list/index.html","permalink":"http://alb1n.com/blog/reading-list/index.html","excerpt":"","text":"My reading listCurrently Reading Socrates: A Man for Our Times To Read Darwin: Portrait of a Genius 2016 Sapiens: A Brief History of Humankind The Subtle Art of Not Giving a F*ck How to Win Friends &amp; Influence People Algorithms to Live By: The Computer Science of Human Decisions The Power of Habit: Why We Do What We Do, and How to Change"},{"title":"Tags","date":"un22fin22","updated":"un22fin22","comments":true,"path":"tags/index.html","permalink":"http://alb1n.com/blog/tags/index.html","excerpt":"","text":""}],"posts":[{"title":"Task logger","slug":"task-logger","date":"un22fin22","updated":"un22fin22","comments":true,"path":"2017/03/14/task-logger/","link":"","permalink":"http://alb1n.com/blog/blog/2017/03/14/task-logger/","excerpt":"","text":"ProblemEveryday I work on multiple issues for multiple clients. So, it’s difficult to track what I do on a daily basis. To track this, I wanted a solution which lets me track the stuff that I do everyday. This also needs to sync across multiple devices, so that I can continue adding my personal tasks that I do as well from my PC. FeaturesFor this, I created a simple script which does the below: Lets me add the task I’m currently working on Syncs them across all my devices Lets me view these tasks history, so that if I want to know what I was working on, say the last Monday, I can view it easily. Design decisionsThese are the questions and the solutions that came to my mind: How am I going to add entries to it? Here, I wanted a quick solution. So, I decided to go with a shell script, which I can execute from my terminal. How should I store the data? I could store it in a SQLite database, however I decided against that. Reason being, if any of my devices does not have SQLite installed, I would have to set it up. To reduce the dependencies, I decided to go with files. Each day’s data would be stored in a file in the format YYYY_MM-DD.log. This is the simplest storage mechanism I could come up with. Maybe group these data files in month and year as required. Where should I store the data? Initially, I thought I would store the data in a directory and setup a cronjob which rsyncs the data with my DO server. This is still a viable option(Refer this). However, since I’m using Dropbox, I thought I would store it into a directory that syncs with Dropbox. This would not have the hassle of setting up the cronjob for rsync on all of my devices. CodeYou can add the below snippet to your .bash_profile or .bashrc file. 12345678910# Logs the data to a Dropbox directoryw() &#123; if [[ $# -eq 0 ]] ; then tail -n 20 ~/Dropbox/tracker/$(date +%Y_%m_%d.log) else filename=~/Dropbox/tracker/$(date +%Y_%m_%d.log) content=&quot;$(date +%H:%M:%S) - $&#123;@&#125;&quot; echo &quot;$content&quot; &gt;&gt; $filename fi&#125; Gist link: https://gist.github.com/albingeorge/e334eb3e33e76c5f2169d0b2b6477130 UsageTo add an entry: 1$ w &quot;Creating post on task logger&quot; To view the last few entries: 123$ w01:45:27 - Back from badminton02:21:39 - Creating post on task logger Limitations You can not log tasks from a mobile I’m okay with this, since I created this just so that I can track the tasks from work. Dependency on Dropbox Later on if I decide to not use Dropbox, I’ll have to look for alternatives. Right now, I do have the rsync alternative though. To do Group files by month and year","categories":[],"tags":[{"name":"task","slug":"task","permalink":"http://alb1n.com/blog/tags/task/"},{"name":"track","slug":"track","permalink":"http://alb1n.com/blog/tags/track/"},{"name":"log","slug":"log","permalink":"http://alb1n.com/blog/tags/log/"},{"name":"sync","slug":"sync","permalink":"http://alb1n.com/blog/tags/sync/"},{"name":"dropbox","slug":"dropbox","permalink":"http://alb1n.com/blog/tags/dropbox/"}]},{"title":"Create a custom page on hexo","slug":"create-a-custom-page-on-hexo","date":"un44fin44","updated":"un22fin22","comments":true,"path":"2017/03/02/create-a-custom-page-on-hexo/","link":"","permalink":"http://alb1n.com/blog/blog/2017/03/02/create-a-custom-page-on-hexo/","excerpt":"","text":"My catch on creating a custom page on hexoCreate a directory under the source directory named reading-list and under that create an index.md file within the above directory. index.md content:123title: &quot;Reading List&quot;layout: &quot;page&quot;--- We’ll add more to this file later. At this point, the URL /reading-list should be pointing to reading-list/index.md that we created just now. If you want to use a custom template for your reading-list page, you would have to create a separate layout file for it. For this, create an ejs file layout/reading-list.ejs in your theme’s directory: 1234567&lt;article class=&quot;article&quot;&gt; &lt;div class=&quot;article-entry&quot;&gt; &lt;div class=&quot;reading-list&quot;&gt; &lt;%- page.content %&gt; &lt;/div&gt; &lt;/div&gt;&lt;/article&gt; I had to add a div with class “article” because the CSS for markdown was available only for the class article from the theme I’m using(icarus). Next comes styles. You have two options here: Add your styles in the themes style using stylus, which gets compiled to CSS and is then used in all the pages Pros: Style in stylus Import existing block’s styles from stylus(basically the advantage of using stylus) Cons: Would be added across all the pages, even if you require it only for a single page. I’m not sure about this, but that’s what I think. Add your style in a separate css file under themes/icarus/source/libs/reading-list-style.css(This path changes based on your theme). Pros and cons: just the reverse of #1. I decided to go with approach #2 here. So, I created a file themes/icarus/source/libs/reading-list-style.css with the below content: 1234567#sidebar &#123; display: none;&#125;#main &#123; width: 75%;&#125; The above CSS is to hide the sidebar on the reading list page(Yea, I’m not very good at CSS). Now, we need to add the above CSS file to our layout. Add the below line in the layout/reading-list.ejs file: 1&lt;link rel=&quot;stylesheet&quot; href=&quot;/libs/reading-list-style.css&quot;&gt; At last, we have the custom page ready. All you need to do now is to add content to your reading-list/index.md file you created earlier. Now, generate the templates by hexo generate command and goto the URL /reading-list. It should load your new custom page “Reading List”.","categories":[],"tags":[{"name":"reading list","slug":"reading-list","permalink":"http://alb1n.com/blog/tags/reading-list/"},{"name":"hexo","slug":"hexo","permalink":"http://alb1n.com/blog/tags/hexo/"},{"name":"custom page","slug":"custom-page","permalink":"http://alb1n.com/blog/tags/custom-page/"},{"name":"style","slug":"style","permalink":"http://alb1n.com/blog/tags/style/"}]}]}